Revit 2026 API

# ContourSettingRemoveItem Method

---

Remove a contour setting item from the current contour setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveItem(
	ContourSettingItem item
)
```
```vb
Public Sub RemoveItem (
	item As ContourSettingItem
)
```
```cpp
public:
void RemoveItem(
	ContourSettingItem^ item
)
```
```fsharp
member RemoveItem :
        item : ContourSettingItem -> unit
```

#### Parameters

item ContourSettingItem
     The contour setting item to be removed.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Contour setting will not be changed if the item could not be found.

#### Reference

ContourSetting Class

Autodesk.Revit.DB Namespace